{"defs":[
    [
      "Teddy Bear",
      "/Lore-Dump/Gredo/Races/General.html",
      "One of the two major artificial forms of life, and one of the only forms of life with human level intelligence and free will. They are the only playable race due to their individuality."
    ],
    [
      "The Ruins",
      "/Lore-Dump/The-Ruins/Overview.html",
      "The common name for the large stretch of crumbling and desolate buildings between the two main waring factions. They are most notable for the lack of control by all factions."
    ],
    [
      "Social Rung",
      "/Character-Creation/Social-Ladder.html",
      "The general term for a single group of Gredo's rigid caste system. All Rungs together are referred to as the Social Ladder."
    ],
    [
      "Social Ladder",
      "/Character-Creation/Social-Ladder.html",
      "The term for Gredo's rigid job assignment and caste system which defines all of its citizens, as well as its Traitors."
    ],
    [
      "Backgrounds",
      "/Character-Creation/Backgrounds.html",
      "A term for describing the skillset a character has from their previous experiences in their life."
    ],
    [
      "Husks",
      "/Equipment-Stash/Husks.html",
      "Due to the nature of Bear brains, they don't need a body to survive. For this reason they refer to their bodies as Husks, which are highly modifiable."
    ],
    [
      "Skills and Traits",
      "/Character-Creation/Skills-and-Traits",
      "A mechanical representation of a characters given ability with specific types of tasks."
    ],
    [
      "Gear",
      "/Equipment-Stash/Home.html",
      "The mechanical term for the things your character carries around with them, including weapons, armor, kits, and their body parts."
    ],
    [
      "Perks",
      "/Character-Creation/Perks.html",
      "Specific and unique talents that your character can employ for an extra edge."
    ],
    [
      "Detriments",
      "/Character-Creation/Detriments.html",
      "The mechanical representation of your characters short comings and flaws."
    ],
    [
      "Character Sheet",
      "/Resources/Character-Sheet.html",
      "Click me to get a copy of the official Ancient Aetherial Character Sheet!"
    ],
    [
      "Copyright Joke",
      "https://www.buildabear.com/",
      "We are in no way associated with Build A Bear Workshop, Inc."
    ],
    [
      "Gredo",
      "/Lore-Dump/Gredo/The-City.html",
      "The large southern faction made entirely of magical constructs in the forms of Teddy Bears."
    ],
    [
      "Hive",
      "/Lore-Dump/The-Hive/Introduction.html",
      "The large single minded enemy that remains in an endless war against Gredo, known for its use of technology that was refined and fully understood by its human ancestors."
    ],
    [
      "Mentors",
      "/Lore-Dump/Gredo/Nobilities/Mentors.html",
      "The Noble group responsible for the creation an raising of new Teddy Bear constructs."
    ],
    [
      "Royals",
      "/Character-Creation/Social-Ladder.html",
      "Gredo's highest Social Rung, responsible for lawmaking and policy crafting."
    ],
    [
      "Nobles",
      "/Character-Creation/Social-Ladder.html",
      "Gredo's 2nd highest Social Rung, responsible for upholding Royal policy and keeping the system running."
    ],
    [
      "Guilds",
      "/Lore-Dump/Gredo/Guilds/Introduction.html",
      "Large profit based private organizations found in Gredo's Second Triad."
    ],
    [
      "Guild Rung",
      "/Character-Creation/Social-Ladder.html",
      "Gredo's 3nd highest Social Rung, responsible for private industry and organization."
    ],
    [
      "Military Rung",
      "/Character-Creation/Social-Ladder.html",
      "Gredo's 4th highest Social Rung, comprised entirely of its armed forces."
    ],
    [
      "Citizens",
      "/Character-Creation/Social-Ladder.html",
      "Gredo's 5th highest Social Rung, which is used as its reserve population for use in assigment to the other Rungs should it be needed."
    ],
    [
      "Workers",
      "/Character-Creation/Social-Ladder.html",
      "Gredo's 2nd lowest Social Rung, responsible for producing all raw and refined materials used by every other Rung, known for its poor treatment."
    ],
    [
      "Residents",
      "/Character-Creation/Social-Ladder.html",
      "Gredo's lowest Social Rung, full of individuals who take up work in the Ruins instead of in Gredo itself."
    ],
    [
      "Traitors",
      "/Character-Creation/Social-Ladder.html",
      "The Social Rung for seperate groups that are not accepted by Gredo's government, typically with revolutionary ideals."
    ],
    [
      "Riot",
      "/Lore-Dump/Gredo/Vocab/Riots.html",
      "A term for a large uprising by Gredo's own people, typically based on class warfare. Riots are typically characterized by large use of fire and a strong military presence after the fact."
    ]
]}
